# jupyter notebook에서 db활용하기

1. MySQLdb import 하기

pip install mysqlclient

In [1]:
import MySQLdb

2. db에 연결하기

In [8]:
db = MySQLdb.connect(
    "db.fastcamp.us",
    "root",
    "dkstncks",
    "jkeun_sample",
    charset='utf8',
)
# 파이썬을 이용해서 MySQL에 연결하는것

In [9]:
cursor = db.cursor()
#cursor = db에서 위치를 알려주는 역할

In [10]:
cursor.execute("SHOW DATABASES;")
cursor.fetchall()

((u'information_schema',),
 (u'JAYWHY',),
 (u'JEONGEUNSEOP',),
 (u'JessieB',),
 (u'angie0829',),
 (u'beomheepark',),
 (u'bright_sample',),
 (u'chibok_sample',),
 (u'dobestan',),
 (u'dobestan_sample',),
 (u'goldstar_sample',),
 (u'goodjob',),
 (u'gs_samples',),
 (u'jkeun_sample',),
 (u'jones_sample',),
 (u'kcchoi_sample',),
 (u'kty_sample',),
 (u'leo_sample',),
 (u'mysql',),
 (u'obolosample',),
 (u'performance_schema',),
 (u'sakila',),
 (u'sechang_sample',),
 (u'sibadog_sample',),
 (u'sunghwan_sample',),
 (u'valentine',),
 (u'world',),
 (u'yanghwi_sample',),
 (u'yudaesung_sample',))

In [7]:
# db.close()
#db와 연결을 끊음

In [17]:
SQL_QUERY = """
    INSERT INTO room (address, phonenumber, deposit, rent)
    VALUES (
        'Seoul, Korea',
        '010-9525-7900',
        '1000',
        '50'
    );
"""

cursor.execute(SQL_QUERY)

1L

In [19]:
cursor.execute(SQL_QUERY)
db.commit()

In [20]:
# mysql에서 보면 옛날꺼 그대로있음
# 데이터베이스의경우 사람들이 실수할수도 있기때문에 데이터를 추가하거나 업데이트,
# 삭제하는 것을 조심스럽게 해야함 commit으로 할수있음

In [24]:
cursor.execute("SELECT * FROM room;")
cursor.fetchall()

((u'????? ??? ???? 4F', u'010-9525-7900', 10000L, 200L),
 (u'Seoul, Korea', u'010-9525-7900', 1000L, 50L),
 (u'Seoul, Korea', u'010-9525-7900', 1000L, 50L),
 (u'Seoul, Korea', u'010-9525-7900', 1000L, 50L),
 (u'Seoul, Korea', u'010-9525-7900', 1000L, 50L),
 (u'Seoul, Korea', u'010-9525-7900', 1000L, 50L),
 (u'Seoul, Korea', u'010-9525-7900', 1000L, 50L))

## db -> 판다스 데이터프레임으로 불러오기

In [22]:
import pandas as pd

In [23]:
pd.read_sql("SELECT * FROM room;", db)

             address    phonenumber  deposit  rent
0  ????? ??? ???? 4F  010-9525-7900    10000   200
1       Seoul, Korea  010-9525-7900     1000    50
2       Seoul, Korea  010-9525-7900     1000    50
3       Seoul, Korea  010-9525-7900     1000    50
4       Seoul, Korea  010-9525-7900     1000    50
5       Seoul, Korea  010-9525-7900     1000    50
6       Seoul, Korea  010-9525-7900     1000    50

# 아까만든 df1000개를 db에 넣기 과제